Tekla Open API Reference for Tekla Structures 2025
PluginPropertyFileLocationAttribute Properties
The PluginPropertyFileLocationAttribute type exposes the following members.
Properties
Name | Description
Subdirectory
Gets the property file subdirectory in a model folder.
Suffix
Gets the property file suffix.
Top
See Also
Reference
PluginPropertyFileLocationAttribute Class
Tekla.Structures.Plugins Namespace